<?php session_start();
$_SESSION['timeout'] = time();

 if ($_SESSION['timeout'] + 10 * 60 < time()) {
    header('Location: logout.php');
 }
?>

<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>More</title>
    <link rel="stylesheet" href="styles/start_styles.css">
    <link rel="stylesheet" href="styles/xazaS.css">
</head>

<body class="body">

    <header>
    <nav>
            <ul>
                <li><div class="account-container">
                    <div class="account-bubble"><?php if(!isset($_SESSION['username']) && !isset($_SESSION['admin'])){
                                                        echo'Χωρίς σύνδεση';
                                                    }else if(isset($_SESSION['username'])){
                                                        echo'Συνδεδεμένος: ' ;
                                                        echo $_SESSION['username'];
                                                    }else if(isset($_SESSION['admin'])){
                                                        echo 'Διαχηρηστης:';
                                                        echo $_SESSION['admin'];
                                                    } ?></div>
                    <div class="dropdown-menu">
                        <?php if(isset($_SESSION['username'])):?>
                            <a href="settings/names.php?username=<?php echo urlencode($_SESSION['username']) ?>" target="_blank">Ρυθμίσεις</a>
                            <a href="logout.php">Αποσύνδεση</a>
                        <?php elseif (isset($_SESSION['admin'])): ?>
                            <a href="control/insert_page.php" target="_blank">Διαχείριση δηλώσεων</a>
                            <a href="logout.php" >Αποσύνδεση</a>
                        <?php else: ?>
                            <a href="login.php" >Συνδέσου!</a>
                            <a href="sign-up.php" >Εγγραφή</a>
                        <?php endif;?>
  
                    </div>
                    </div></li>
                <li><a href="index.php">Αρχικη</a></li>
                <li><a href="find-a-room.php?int=<?php echo urlencode(5) ?>">Αναζήτηση</a></li>
                <li><a href="create_page.php">Καταχώριση </a></li>
                <li><a href="more.php">Περισσότερα</a></li>
            </ul>
        </nav>
    </header>

    <div class="container">
        
        <img src="media/panorama6.jpg" alt="Example Image" class="panoimgalts">

        <p>Η Αμοργός είναι κυκλαδίτικο νησί του Αιγαίου πελάγους. Πήρε το όνομά της από το φυτό αμοργίς,
             ένα είδος λιναριού από το οποίο φτιάχνονταν οι «άλικοι αμοργίδες», χιτώνες της Αμοργού. Βρίσκεται στο 
             νοτιοανατολικό άκρο των Κυκλάδων, νοτιοανατολικά της Νάξου και σε απόσταση 136 ναυτικών μιλίων από τον Πειραιά. 
             Η επιφάνειά της εκτιμάται στα 121,464 τ.χλμ., ενώ έχει μήκος ακτών 126 χιλιόμετρα. Είναι μακρόστενο νησί που εκτείνεται 
             από ΝΔ προς ΒΑ με απότομη ορεινή μορφολογία εδάφους. Διαθέτει δύο φυσικά λιμάνια, τα Κατάπολα και την Αιγιάλη. Πρωτεύουσα 
             είναι η Χώρα Αμοργού με κύριο λιμάνι τα Κατάπολα.</p>

       

        <h3> Ιστορία</h3>

        <p>Από τα τέλη της 4ης χιλιετίας π.Χ. υπάρχουν ίχνη ανθρώπινης παρουσίας στην Αμοργό. Κατά την αρχαιότητα η Αμοργός γίνεται ένα 
            από τα σημαντικότερα κέντρα του κυκλαδικού πολιτισμού. Αργότερα, κατά τη μινωική εποχή, καταφθάνουν στο νησί πολλοί Μινωίτες 
            ιδρύοντας μία από τις πρώτες πόλεις του νησιού, τη Μινώα. Αργότερα, Ναξιώτες ιδρύουν την Αρκεσίνη, στη σημερινή περιοχή Καστρί 
            και την ίδια εποχή Μιλήσιοι εγκαθίστανται στην Αιγιάλη, κοντά στο σημερινό χωριό Θολάρια. Αυτές ήταν κατά την αρχαιότητα οι σπουδαιότερες 
            πόλεις του νησιού. Στους ρωμαϊκούς χρόνους θα είναι τόπος εξορίας: επί Τιβερίου, το 23 μ.Χ. θα εξοριστεί ο Βέβιος Σειρήνος, ανθύπατος της Ισπανίας. 
            Τα βυζαντινά χρόνια δέχεται επιδρομές Πειρατών ενώ ιδρύεται η μονή της Παναγίας της Χοζοβιώτισσας. Το 1207 την καταλαμβάνει ο Μάρκος Σανούδος και ξεκινά η 
            περίοδος της λατινοκρατίας έως το 1537 οπότε επέδραμε ο Χαϊρεντίν Μπαρμπαρόσα και την έθεσε υπό οθωμανική κυριαρχία (1537-1824). Οι Αμοργιανοί ασκούσαν την πειρατεία 
            συστηματικά. Το νησί έχει την ιδιαιτερότητα να διατηρεί μεγάλο πλήθος επιφανών βυζαντινών επωνύμων. Μετά την επανάσταση του 1821 ενσωματώθηκε στο νεοσύστατο ελληνικό κράτος 
            ενώ λίγα χρόνια αργότερα η Αμοργός χρησιμοποιήθηκε πάλι ως τόπος εξορίας. Την περίοδο της κατοχής από τις δυνάμεις του Άξονα εντάσσεται αρχικά στην ιταλική διοίκηση 
            ενώ από το 1943 τη διαδέχεται η γερμανική έως την απελευθέρωση το 1944. Η φήμη του νησιού εκτοξεύτηκε με την προβολή της ταινίας Απέραντο γαλάζιο (Le Grand Bleu) σε
             σκηνοθεσία του Λικ Μπεσόν η οποία γυρίστηκε κατά μεγάλο μέρος στην Αμοργό. Η Αμοργός αποτέλεσε και το πρώτο μέρος στην Ευρώπη που φιλοξένησε διεθνή κινηματογραφική 
             παραγωγή, μετά την παγκόσμια πανδημία του κορονοϊού το 2020.</p>
             <p>Η παραλία της Αγίας Άννας με το ομώνυμο εκκλησάκι πάνω από τον κολπίσκο της, είναι ίσως η διασημότερη παραλία του νησιού, καθώς εκεί γυρίστηκαν σκηνές από μέρος 
                της ταινίας Απέραντο γαλάζιο (The big blue) του Λικ Μπεσόν με πρωταγωνιστή τον γνωστό ηθοποιό Ζαν Ρενό. Βρίσκεται μόλις τρία χιλιόμετρα από τη Χώρα της Αμοργού, και μόλις 
                ενάμισι από το μοναστήρι της Παναγίας Χοζοβιώτισσας. Σήμα κατατεθέν της παραλίας είναι τα καθαρά κρυστάλλινα γαλαζοπράσινα νερά τα οποία σε συνδυασμό με τη βραχώδη περιοχή 
                και τα πράσινα περιβόλια επάνω από την ακτή, συνθέτουν τη λεγόμενη «άγρια ομορφιά» του τοπίου. Κατεβαίνοντας (προς τα αριστερά σας) θα συναντήσετε το μικρό εκκλησάκι, όπου 
                ενίοτε επιλεγόταν για γάμους και βαφτίσια ακόμη και από ξένους τουρίστες του νησιού. Έπειτα θα προσεγγίσετε την παραλία η οποία είναι βραχώδης με χοντρό και λεπτό βοτσαλάκι.

                Όσοι κολυμπήσουν στα βαθιά νερά της, θα αντικρίσουν έπειτα από ένα σημείο, μέρος του μοναστηριού να ορθώνεται ψηλά αντίκρυ τους στα αριστερά. Για όσους αντέχουν το περπάτημα
                 πριν την πρώτη βουτιά στη θάλασσα, υπάρχουν κρυφά μονοπατάκια που περνάνε ανάμεσα από τα βράχια και προσφέρουν λιγότερο θορυβώδεις στιγμές χαλάρωσης και ενίοτε σκιά. Η παραλία 
                 είναι μικρής έκτασης με ελάχιστες στάσεις δροσιάς ανάμεσα στα βράχια, ενώ οι καλύτερες ώρες να την επισκεφθείτε είναι οι πρωινές ή οι πρώτες απογευματινές, καθώς το μεσημέρι 
                 υπάρχει αρκετός συνωστισμός. Η χρήση αντηλιακού συστήνεται. Απέχει 3 χιλιόμετρα από τη Χώρα.</p>
                 <img src="media/panorama4.jpg" alt="Example Image" class="panoimgalt">

                <h3>Πεζοπορικές Διαδρομές</h3>

                 <h6>Χώρα - Μονή Χοζοβιώτισσας - Ξενοδοχιό - Άργιλας - Ασφοντηλίτης - Όξω Μεριά - Ποταμός (4-5 ώρες)</h6>
                    <h6>Κατάπολα (Πέρα Ραχίδι) - (Μηλιές) - Χώρα (1 ώρα ανάβαση, 40 λεπτά κατάβαση)</h6>
                        <h6>Κατάπολα - (Μινώα) - Αγία Θέκλη - Δωκαθίσματα - Καμάρι - Παναγία Καστριανή - Βρούτση - Ραχούλα - Αρκεσίνη (4-5 ώρες)</h6>
                            <h6>Όρμος Αιγιάλης - Λαγκάδα - Στρούμπος - Θολάρια - Φωκιότρυπα (2-3 ώρες)</h6>
                                <h6>Λαγκάδα - Άγιος Θεολόγος - Σταυρός (2 ώρες)</h6>
                                    <h6>Άγιος Γεώργιος Βαρσαμίτης - Μινώα-Κατάπολα (45 λεπτά)</h6>
                                        <h6>Κατάπολα - Χώρα (1 ώρα 15 λεπτά ανάβαση, 50 λεπτά κατάβαση)</h6>
                                            <h6> Κατάπολα - Οικισμός Τα Νερά - Φάρος Άη Λιά (1 ώρα 30 λεπτά)</h6>
                                                <h6> Χώρα - Παραλία Αγίας Άννας (30 λεπτά κατάβαση, 1 ώρα ανάβαση)</h6>
                                                    <h6>  Χώρα - Τερλάκι - Ξυλοκερατίδι (2 ώρες)</h6>
                                                    <img src="media/panorama5.jpg" alt="Example Image" class="panoimgalt">
                                                        <h6>  (Χώρα) - Προφήτης Ηλίας (1 ώρα 15 λεπτά)</h6>
                                                            <h6> Αρκεσίνη - Παραλία Αμμούδι (30 λεπτά κατάβαση, 45 λεπτά ανάβαση)</h6>
                                                                <h6>Αρκεσίνη - Μαύρη Μύτη - Πόρτο Ακρωτήρι (45 λεπτά)</h6>
                                                                    <h6>  Θολάρια - Όρμος Μικρής Βλυχάδας (30 λεπτά κατέβασμα, 45 λεπτά ανάβαση)</h6>
                                                                        <h6> Λαγκάδα - Μαχός (1 ώρα)</h6>
                                                                            <h6>  Λαγκάδα - Γέρος Σταυρός (30 λεπτά ανάβαση)</h6>
                                                                                <h6>  Θολάρια - Χρυσόστομος - Φάρος - Χόχλακας - Φωκιότρυπα (2 ώρες)</h6>
        </div>


</body>
</html>